//////////////////////////////////////////////////////////////////
//
//2018/5/14～
//製作者 京都コンピュータ学院京都駅前校ゲーム学科四回生　吉田純基
//
//////////////////////////////////////////////////////////////////

using System;
using UnityEngine;

/// <summary>
/// エフェクト自動消滅用
/// </summary>
public class MyAutoDestroyer : MonoBehaviour {

    int m_time;

    //----------------------------------------------------------------------------------------------------
    /// <summary>
    /// 時間経過で削除
    /// </summary>
    void Update () {
        m_time++;
        if (m_time > 180)
        {
            Destroy(this.gameObject);
        }
	}
}
